Revit 2027 API
BuiltInFailures.CurveFailures.LineTooShortWarning Property
 Line is too short.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId LineTooShortWarning { get; }
Public Shared ReadOnly Property LineTooShortWarning As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ LineTooShortWarning {
	FailureDefinitionId^ get ();
}
static member LineTooShortWarning : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CurveFailures Class
Autodesk.Revit.DB Namespace